# Задание №1

petType = input("Пожалуйста, введите вид вашего питомца: ")
petName = input("Введите также его имя: ")
petAge = input("Введите возраст питомца: ")

print("Это ", petType, " по кличке \"", petName, "\". Возраст: ", petAge, " года.", sep="")